ghosoft/stc-mcu-open-source/header-generator/stc16.h
/*
 * Copyright (c) 2022 Vincent DEFERT. All rights reserved.
 * 
 * Redistribution and use in source and binary forms, with or without 
 * modification, are permitted provided that the following conditions 
 * are met:
 * 
 * 1. Redistributions of source code must retain the above copyright 
 * notice, this list of conditions and the following disclaimer.
 * 
 * 2. Redistributions in binary form must reproduce the above copyright 
 * notice, this list of conditions and the following disclaimer in the 
 * documentation and/or other materials provided with the distribution.
 * 
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS 
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE 
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, 
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, 
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; 
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER 
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT 
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN 
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE 
 * POSSIBILITY OF SUCH DAMAGE.
 */

/**
 * @file stc16.h
 * 
 * Register, bit and macro definitions for the STC16
 */

#ifndef _STC16_H
#define _STC16_H

#include <compiler.h>

// SFR P0: Port 0
SFR(P0, 0x80);
SBIT(P0_0, 0x80, 0);
SBIT(P0_1, 0x80, 1);
SBIT(P0_2, 0x80, 2);
SBIT(P0_3, 0x80, 3);
SBIT(P0_4, 0x80, 4);
SBIT(P0_5, 0x80, 5);
SBIT(P0_6, 0x80, 6);
SBIT(P0_7, 0x80, 7);

// SFR SP: Stack Pointer
SFR(SP, 0x81);

// SFR DPL: Data Pointer (DPTR) low
SFR(DPL, 0x82);

// SFR DPH: Data Pointer (DPTR) high
SFR(DPH, 0x83);

// SFR DPXL: Data pointer (highest byte)
SFR(DPXL, 0x84);

// SFR USBCLK: USB clock control register
SFR(USBCLK, 0x85);
#define PHYTST0 0x1
#define PHYTST1 0x2
#define TST_PHY 0x4
#define TST_USB 0x8
#define CRE 0x10
#define PCKI0 0x20
#define PCKI1 0x40
#define ENCKM 0x80

// SFR DPS: DPTR pointer selector
SFR(DPS, 0x86);
#define DPSEL 0x1
#define AU0 0x8
#define AU1 0x10
#define TSL 0x20
#define ID0 0x40
#define ID1 0x80

// SFR PCON: Power control register
SFR(PCON, 0x87);
#define IDL 0x1
#define PD 0x2
#define GF0 0x4
#define GF1 0x8
#define POF 0x10
#define LVDF 0x20
#define SMOD0 0x40
#define SMOD 0x80

// SFR TCON: Timer control register
SFR(TCON, 0x88);
SBIT(IT0, 0x88, 0);
SBIT(IE0, 0x88, 1);
SBIT(IT1, 0x88, 2);
SBIT(IE1, 0x88, 3);
SBIT(TR0, 0x88, 4);
SBIT(TF0, 0x88, 5);
SBIT(TR1, 0x88, 6);
SBIT(TF1, 0x88, 7);

// SFR TMOD: Timer mode register
SFR(TMOD, 0x89);
#define T0_M0 0x1
#define T0_M1 0x2
#define T0_C_T 0x4
#define T0_GATE 0x8
#define T1_M0 0x10
#define T1_M1 0x20
#define T1_C_T 0x40
#define T1_GATE 0x80

// SFR TL0: Timer 0 low byte
SFR(TL0, 0x8A);

// SFR TL1: Timer 1 low byte
SFR(TL1, 0x8B);

// SFR TH0: Timer 0 high byte
SFR(TH0, 0x8C);

// SFR TH1: Timer 1 high byte
SFR(TH1, 0x8D);

// SFR CKCON: XRAM control register
SFR(CKCON, 0x8E);
#define CKCON0 0x1
#define CKCON1 0x2
#define CKCON2 0x4
#define T0M 0x8
#define T1M 0x10

// SFR DMAIR: FMU DMA instruction register
SFR(DMAIR, 0x8F);

// SFR P1: Port 1
SFR(P1, 0x90);
SBIT(P1_0, 0x90, 0);
SBIT(P1_1, 0x90, 1);
SBIT(P1_2, 0x90, 2);
SBIT(P1_3, 0x90, 3);
SBIT(P1_4, 0x90, 4);
SBIT(P1_5, 0x90, 5);
SBIT(P1_6, 0x90, 6);
SBIT(P1_7, 0x90, 7);

// SFR USBCON: USB control register
SFR(USBCON, 0x91);
#define DM 0x1
#define DP 0x2
#define DFREC 0x4
#define PDEN 0x8
#define PUEN 0x10
#define PS2M 0x20
#define USBRST 0x40
#define ENUSB 0x80

// SFR WTST: Program read control register
SFR(WTST, 0x92);

// SFR AUXR1: Auxiliary register 1
SFR(AUXR1, 0x93);
#define SIST2 0x1
#define EXTRAM 0x2
#define T2x12 0x4
#define T2_C_T 0x8
#define T2R 0x10
#define UART_M0x6 0x20
#define T1x12 0x40
#define T0x12 0x80

// SFR AUXR2: Auxiliary register 2
SFR(AUXR2, 0x94);
#define LINEN 0x1
#define CANEN 0x2
#define TXLNRX 0x10
#define ADIBF 0x20
#define P40ADR 0x40

// SFR INTCLKO: 
SFR(INTCLKO, 0x95);
#define T0CLKO 0x1
#define T1CLKO 0x2
#define T2CLKO 0x4
#define EX2 0x10
#define EX3 0x20
#define EX4 0x40

// SFR USBADR: USB address register
SFR(USBADR, 0x96);
#define UADR0 0x1
#define UADR1 0x2
#define UADR2 0x4
#define UADR3 0x8
#define UADR4 0x10
#define UADR5 0x20
#define AUTORD 0x40
#define BUSY 0x80

// SFR USBDAT: USB data register
SFR(USBDAT, 0x97);

// SFR SCON: Serial port 1 control register
SFR(SCON, 0x98);
SBIT(RI, 0x98, 0);
SBIT(TI, 0x98, 1);
SBIT(RB8, 0x98, 2);
SBIT(TB8, 0x98, 3);
SBIT(REN, 0x98, 4);
SBIT(SM2, 0x98, 5);
SBIT(SM1, 0x98, 6);
SBIT(SM0_FE, 0x98, 7);

// SFR SBUF: Serial port 1 buffer register
SFR(SBUF, 0x99);

// SFR P_SW1: Peripheral port switching register 1
SFR(P_SW1, 0x9A);
#define LIN_S0 0x1
#define LIN_S1 0x2
#define SPI_S0 0x4
#define SPI_S1 0x8
#define CAN_S0 0x10
#define CAN_S1 0x20
#define S1_S0 0x40
#define S1_S1 0x80

// SFR P_SW2: Peripheral port switching register 2
SFR(P_SW2, 0x9B);
#define S2_S 0x1
#define S3_S 0x2
#define S4_S 0x4
#define CMPO_S 0x8
#define I2C_S0 0x10
#define I2C_S1 0x20
#define EAXFR 0x80

// SFR LIRTRIM: IRC frequency trim register
SFR(LIRTRIM, 0x9E);
#define LIRTRIM0 0x1
#define LIRTRIM1 0x2

// SFR IRTRIM: IRC frequency adjustment register
SFR(IRTRIM, 0x9F);

// SFR P2: Port 2
SFR(P2, 0xA0);
SBIT(P2_0, 0xA0, 0);
SBIT(P2_1, 0xA0, 1);
SBIT(P2_2, 0xA0, 2);
SBIT(P2_3, 0xA0, 3);
SBIT(P2_4, 0xA0, 4);
SBIT(P2_5, 0xA0, 5);
SBIT(P2_6, 0xA0, 6);
SBIT(P2_7, 0xA0, 7);

// SFR CANICR: CANBUS interrupt control register
SFR(CANICR, 0xA1);
#define PCANL 0x1
#define ECAN 0x2
#define CANIF 0x4
#define PCANH 0x8

// SFR CANAR: CANBUS address register
SFR(CANAR, 0xA2);

// SFR CANDR: CANBUS data register
SFR(CANDR, 0xA3);

// SFR IE: Interrupt enable register
SFR(IE, 0xA8);
SBIT(EX0, 0xA8, 0);
SBIT(ET0, 0xA8, 1);
SBIT(EX1, 0xA8, 2);
SBIT(ET1, 0xA8, 3);
SBIT(ES, 0xA8, 4);
SBIT(EADC, 0xA8, 5);
SBIT(ELVD, 0xA8, 6);
SBIT(EA, 0xA8, 7);

// SFR IRCBAND: IRC band selection detection
SFR(IRCBAND, 0xA9);
#define BANDSEL 0x1

// SFR WKTCL: Power-down wake-up timer low byte
SFR(WKTCL, 0xAA);

// SFR WKTCH: Power-down wake-up timer high byte
SFR(WKTCH, 0xAB);
#define WKTEN 0x80

// SFR P3: Port 3
SFR(P3, 0xB0);
SBIT(P3_0, 0xB0, 0);
SBIT(P3_1, 0xB0, 1);
SBIT(P3_2, 0xB0, 2);
SBIT(P3_3, 0xB0, 3);
SBIT(P3_4, 0xB0, 4);
SBIT(P3_5, 0xB0, 5);
SBIT(P3_6, 0xB0, 6);
SBIT(P3_7, 0xB0, 7);

