ghosoft/stc-mcu-open-source/header-generator/stc16.h
// SFR LINICR: LINBUS interrupt control register
SFR(LINICR, 0xB1);
#define PLINL 0x1
#define ELIN 0x2
#define LINIF 0x4
#define PLINH 0x8

// SFR LINAR: LINBUS address register
SFR(LINAR, 0xB2);

// SFR LINDR: LINBUS data register
SFR(LINDR, 0xB3);

// SFR CMPCR1: Comparator control register 1
SFR(CMPCR1, 0xB4);
#define CMPRES 0x1
#define CMPOE 0x2
#define NIS 0x4
#define PIS 0x8
#define NIE 0x10
#define PIE 0x20
#define CMPIF 0x40
#define CMPEN 0x80

// SFR CMPCR2: Comparator control register 2
SFR(CMPCR2, 0xB5);
#define LCDTY0 0x1
#define LCDTY1 0x2
#define LCDTY2 0x4
#define LCDTY3 0x8
#define LCDTY4 0x10
#define LCDTY5 0x20
#define DISFLT 0x40
#define INVCMPO 0x80

// SFR IP2H: Interrupt priority control register 2 high
SFR(IP2H, 0xB6);
#define PS2H 0x1
#define PSPIH 0x2
#define PUSBH 0x4
#define PPWMB 0x8
#define PX4H 0x10
#define PCMPH 0x20
#define PI2CH 0x40

// SFR IPH: Interrupt priority control register high
SFR(IPH, 0xB7);
#define PX0H 0x1
#define PT0H 0x2
#define PX1H 0x4
#define PT1H 0x8
#define PSH 0x10
#define PADCH 0x20
#define PLVDH 0x40
#define PPWMAH 0x80

// SFR IP: Interrupt priority control register low
SFR(IP, 0xB8);
SBIT(PX0, 0xB8, 0);
SBIT(PT0, 0xB8, 1);
SBIT(PX1, 0xB8, 2);
SBIT(PT1, 0xB8, 3);
SBIT(PS, 0xB8, 4);
SBIT(PADC, 0xB8, 5);
SBIT(PLVD, 0xB8, 6);
SBIT(PPWMA, 0xB8, 7);

// SFR SPSTAT: SPI status register
SFR(SPSTAT, 0xB9);
#define WCOL 0x40
#define SPIF 0x80

// SFR SPCTL: SPI control register
SFR(SPCTL, 0xBA);
#define SPR0 0x1
#define SPR1 0x2
#define CPHA 0x4
#define CPOL 0x8
#define MSTR 0x10
#define DORD 0x20
#define SPEN 0x40
#define SSIG 0x80

// SFR SPDAT: SPI data register
SFR(SPDAT, 0xBB);

// SFR S4CON: Serial port 4 control register
SFR(S4CON, 0xBC);
#define S4RI 0x1
#define S4TI 0x2
#define S4RB8 0x4
#define S4TB8 0x8
#define S4REN 0x10
#define S4SM2 0x20
#define S4ST4 0x40
#define S4SM0 0x80

// SFR S4BUF: Serial port 4 buffer register
SFR(S4BUF, 0xBD);

// SFR SPH: Stack pointer high byte
SFR(SPH, 0xBE);

// SFR BUS_SPEED: Bus speed control register
SFR(BUS_SPEED, 0xBF);
#define SPEED0 0x1
#define SPEED1 0x2
#define SPEED2 0x4
#define RW_S0 0x40
#define RW_S1 0x80

// SFR P4: Port 4
SFR(P4, 0xC0);
SBIT(P4_0, 0xC0, 0);
SBIT(P4_1, 0xC0, 1);
SBIT(P4_2, 0xC0, 2);
SBIT(P4_3, 0xC0, 3);
SBIT(P4_4, 0xC0, 4);
SBIT(P4_5, 0xC0, 5);
SBIT(P4_6, 0xC0, 6);
SBIT(P4_7, 0xC0, 7);

// SFR : 
SFR(, 0xC1);

// SFR IAP_DATA: IAP data register
SFR(IAP_DATA, 0xC2);

// SFR IAP_ADDRH: IAP address register high
SFR(IAP_ADDRH, 0xC3);

// SFR IAP_ADDRL: IAP address register low
SFR(IAP_ADDRL, 0xC4);

// SFR IAP_CMD: IAP command register
SFR(IAP_CMD, 0xC5);
#define CMD0 0x1
#define CMD1 0x2

// SFR IAP_TRIG: IAP trigger register
SFR(IAP_TRIG, 0xC6);

// SFR IAP_CONTR: IAP control register
SFR(IAP_CONTR, 0xC7);
#define CMD_FAIL 0x10
#define SWRST 0x20
#define SWBS 0x40
#define IAPEN 0x80

// SFR P5: Port 5
SFR(P5, 0xC8);
SBIT(P5_0, 0xC8, 0);
SBIT(P5_1, 0xC8, 1);
SBIT(P5_2, 0xC8, 2);
SBIT(P5_3, 0xC8, 3);
SBIT(P5_4, 0xC8, 4);

// SFR T4H: Timer 4 high byte
SFR(T4H, 0xC9);

// SFR T4L: Timer 4 low byte
SFR(T4L, 0xCA);

// SFR T3H: Timer 3 high byte
SFR(T3H, 0xCB);

// SFR T3L: Timer 3 low byte
SFR(T3L, 0xCC);

// SFR T2H: Timer 2 high byte
SFR(T2H, 0xCD);

// SFR T2L: Timer 2 low byte
SFR(T2L, 0xCE);

// SFR PSW: Program status word register
SFR(PSW, 0xD0);
SBIT(P, 0xD0, 0);
SBIT(OV, 0xD0, 2);
SBIT(RS0, 0xD0, 3);
SBIT(RS1, 0xD0, 4);
SBIT(F0, 0xD0, 5);
SBIT(AC, 0xD0, 6);
SBIT(CY, 0xD0, 7);

// SFR PSW1: Program status word 1 register
SFR(PSW1, 0xD1);
#define Z 0x2
#define OV 0x4
#define RS0 0x8
#define RS1 0x10
#define N 0x20
#define AC 0x40
#define CY 0x80

// SFR P7M1: P7 port configuration register 1
SFR(P7M1, 0xD2);

// SFR P7M0: P7 port configuration register 0
SFR(P7M0, 0xD3);

// SFR AUXINTF: Extended external interrupt flag register
SFR(AUXINTF, 0xDA);
#define T2IF 0x1
#define T3IF 0x2
#define T4IF 0x4
#define INT2IF 0x10
#define INT3IF 0x20
#define INT4IF 0x40

// SFR T4T3M: Timer 4/3 control register
SFR(T4T3M, 0xDB);
#define T3CLKO 0x1
#define T3x12 0x2
#define T3_C_T 0x4
#define T3R 0x8
#define T4CLKO 0x10
#define T4x12 0x20
#define T4_C_T 0x40
#define T4R 0x80

// SFR ADC_CONTR: ADC control register
SFR(ADC_CONTR, 0xDC);
#define ADC_CHS0 0x1
#define ADC_CHS1 0x2
#define ADC_CHS2 0x4
#define ADC_CHS3 0x8
#define ADC_FLAG 0x20
#define ADC_START 0x40
#define ADC_POWER 0x80

// SFR ADC_RES: ADC conversion result register high
SFR(ADC_RES, 0xDD);

// SFR ADC_RESL: ADC conversion result register low
SFR(ADC_RESL, 0xDE);

// SFR ADCCFG: ADC configuration register
SFR(ADCCFG, 0xDF);
#define ADC_SPEED0 0x1
#define ADC_SPEED1 0x2
#define ADC_SPEED2 0x4
#define ADC_SPEED3 0x8
#define RESFMT 0x20

// SFR ACC: Accumulator
SFR(ACC, 0xE0);

// SFR SADDR: Serial port 1 slave address register
SFR(SADDR, 0xE1);

// SFR SADEN: Serial port 1 slave address mask register
SFR(SADEN, 0xE2);

// SFR S2CON: Serial port 2 control register
SFR(S2CON, 0xE3);
#define S2RI 0x1
#define S2TI 0x2
#define S2RB8 0x4
#define S2TB8 0x8
#define S2REN 0x10
#define S2SM2 0x20
#define S2SM0 0x80

// SFR S2BUF: Serial port 2 buffer register
SFR(S2BUF, 0xE4);

// SFR S3CON: Serial port 3 control register
SFR(S3CON, 0xE5);
#define S3RI 0x1
#define S3TI 0x2
#define S3RB8 0x4
#define S3TB8 0x8
#define S3REN 0x10
#define S3SM2 0x20
#define S3ST4 0x40
#define S3SM0 0x80

// SFR S3BUF: Serial port 3 buffer register
SFR(S3BUF, 0xE6);

// SFR IE2: Interrupt enable register 2
SFR(IE2, 0xE7);
#define ES2 0x1
#define ESPI 0x2
#define ET2 0x4
#define ES3 0x8
#define ES4 0x10
#define ET3 0x20
#define ET4 0x40

// SFR P6: Port 6
SFR(P6, 0xE8);

// SFR MXAX: MOVX extended address register
SFR(MXAX, 0xEA);

// SFR TA: DPTR timing control register
SFR(TA, 0xEB);

// SFR P5M1: P5 port configuration register 1
SFR(P5M1, 0xEC);

// SFR P5M0: P5 port configuration register 0
SFR(P5M0, 0xED);

// SFR P6M1: P6 port configuration register 1
SFR(P6M1, 0xEE);

// SFR P6M0: P6 port configuration register 0
SFR(P6M0, 0xEF);

// SFR B: B register
SFR(B, 0xF0);

// SFR P0M1: P0 port configuration register 1
SFR(P0M1, 0xF1);

// SFR P0M0: P0 port configuration register 0
SFR(P0M0, 0xF2);

// SFR P1M1: P1 port configuration register 1
SFR(P1M1, 0xF3);

// SFR P1M0: P1 port configuration register 0
SFR(P1M0, 0xF4);

