ghosoft/stc-mcu-open-source/header-generator/stc16.h
// SFR P2M1: P2 port configuration register 1
SFR(P2M1, 0xF5);

// SFR P2M0: P2 port configuration register 0
SFR(P2M0, 0xF6);

// SFR IAP_TPS: IAP latency control register
SFR(IAP_TPS, 0xF7);
#define IAPTPS0 0x1
#define IAPTPS1 0x2
#define IAPTPS2 0x4
#define IAPTPS3 0x8
#define IAPTPS4 0x10
#define IAPTPS5 0x20

// SFR P7: Port 7
SFR(P7, 0xF8);

// SFR P3M1: P3 port configuration register 1
SFR(P3M1, 0xF9);

// SFR P3M0: P3 port configuration register 0
SFR(P3M0, 0xFA);

// SFR P4M1: P4 port configuration register 1
SFR(P4M1, 0xFB);

// SFR P4M0: P4 port configuration register 0
SFR(P4M0, 0xFC);

// SFR WDT_CONTR: Watchdog control register
SFR(WDT_CONTR, 0xFD);
#define WDT_PS0 0x1
#define WDT_PS1 0x2
#define WDT_PS2 0x4
#define IDL_WDT 0x8
#define CLR_WDT 0x10
#define EN_WDT 0x20
#define WDT_FLAG 0x80

// SFR IP2: Interrupt priority control register 2 low
SFR(IP2, 0xFE);
#define PS2 0x1
#define PSPI 0x2
#define PPWMA 0x4
#define PX4 0x10
#define PI2C 0x40

// SFR RSTCFG: Reset configuration register
SFR(RSTCFG, 0xFF);
#define LVDS0 0x1
#define LVDS1 0x2
#define P54RST 0x10
#define ENLVR 0x40

// SFR MD3: MDU data register
SFRX(MD3, 0x7EFCF0);

// SFR MD2: MDU data register
SFRX(MD2, 0x7EFCF1);

// SFR MD1: MDU data register
SFRX(MD1, 0x7EFCF2);

// SFR MD0: MDU data register
SFRX(MD0, 0x7EFCF3);

// SFR MD5: MDU data register
SFRX(MD5, 0x7EFCF4);

// SFR MD4: MDU data register
SFRX(MD4, 0x7EFCF5);

// SFR ARCON: MDU mode control register
SFRX(ARCON, 0x7EFCF6);
#define SC0 0x1
#define SC1 0x2
#define SC2 0x4
#define SC3 0x8
#define SC4 0x10
#define MODE0 0x20
#define MODE1 0x40
#define MODE2 0x80

// SFR OPCON: MDU operation control register
SFRX(OPCON, 0x7EFCF7);
#define ENOP 0x1
#define RST 0x2
#define MDOV 0x40

// SFR CKSEL: Clock selection register
SFRX(CKSEL, 0x7EFE00);
#define MCKSEL0 0x1
#define MCKSEL1 0x2

// SFR CLKDIV: Clock divider register
SFRX(CLKDIV, 0x7EFE01);

// SFR IRC24MCR: Internal 24MHz RC oscillator control register
SFRX(IRC24MCR, 0x7EFE02);
#define IRC24MST 0x1
#define ENIRC24M 0x80

// SFR XOSCCR: External crystal oscillator control register
SFRX(XOSCCR, 0x7EFE03);
#define XOSCST 0x1
#define XITYPE 0x40
#define ENXOSC 0x80

// SFR IRC32KCR: Internal 32kHz RC oscillator control register
SFRX(IRC32KCR, 0x7EFE04);
#define IRC32KST 0x1
#define ENIRC32K 0x80

// SFR PLLCR: PLL control register
SFRX(PLLCR, 0x7EFE05);
#define PLLST 0x1
#define PLLTOMSEL0 0x2
#define PLLTOMSEL1 0x4
#define PLLINCTL0 0x8
#define PLLINCTL1 0x10
#define PLLSSEL0 0x20
#define PLLSSEL1 0x40
#define ENPLL 0x80

// SFR USBCON1: USB control register 1
SFRX(USBCON1, 0x7EFE06);
#define TRIMLDO330 0x2
#define TRIMLDO331 0x4
#define TRIMLDO332 0x8
#define TRIMLDO333 0x10
#define TRIMPLL0 0x20
#define TRIMPLL1 0x40
#define ENLDO33 0x80

// SFR MCLKOCR: Master clock output control register
SFRX(MCLKOCR, 0x7EFE07);
#define MCLKODIV0 0x1
#define MCLKODIV1 0x2
#define MCLKODIV2 0x4
#define MCLKODIV3 0x8
#define MCLKODIV4 0x10
#define MCLKODIV5 0x20
#define MCLKODIV6 0x40
#define MCLKO_S 0x80

// SFR IRC48MCR: Internal 48MHz RC oscillator control register
SFRX(IRC48MCR, 0x7EFE08);
#define IRC48MST 0x1
#define ENIRC48M 0x80

// SFR IRC48ATRIM: Internal 48MHz RC oscillator TRIM register A
SFRX(IRC48ATRIM, 0x7EFE09);
#define ATRIM0 0x1
#define ATRIM1 0x2
#define ATRIM2 0x4
#define ATRIM3 0x8
#define ATRIM4 0x10

// SFR IRC48BTRIM: Internal 48MHz RC oscillator TRIM register B
SFRX(IRC48BTRIM, 0x7EFE0A);

// SFR IRCDB: Internal high-speed oscillator debounce control
SFRX(IRCDB, 0x7EFE0B);

// SFR P0PU: Port 0 pull-up resistor control register
SFRX(P0PU, 0x7EFE10);

// SFR P1PU: Port 1 pull-up resistor control register
SFRX(P1PU, 0x7EFE11);

// SFR P2PU: Port 2 pull-up resistor control register
SFRX(P2PU, 0x7EFE12);

// SFR P3PU: Port 3 pull-up resistor control register
SFRX(P3PU, 0x7EFE13);

// SFR P4PU: Port 4 pull-up resistor control register
SFRX(P4PU, 0x7EFE14);

// SFR P5PU: Port 5 pull-up resistor control register
SFRX(P5PU, 0x7EFE15);

// SFR P6PU: Port 6 pull-up resistor control register
SFRX(P6PU, 0x7EFE16);

// SFR P7PU: Port 7 pull-up resistor control register
SFRX(P7PU, 0x7EFE17);

// SFR P0NCS: Port 0 Schmidt trigger control register
SFRX(P0NCS, 0x7EFE18);

// SFR P1NCS: Port 1 Schmidt trigger control register
SFRX(P1NCS, 0x7EFE19);

// SFR P2NCS: Port 2 Schmidt trigger control register
SFRX(P2NCS, 0x7EFE1A);

// SFR P3NCS: Port 3 Schmidt trigger control register
SFRX(P3NCS, 0x7EFE1B);

// SFR P4NCS: Port 4 Schmidt trigger control register
SFRX(P4NCS, 0x7EFE1C);

// SFR P5NCS: Port 5 Schmidt trigger control register
SFRX(P5NCS, 0x7EFE1D);

// SFR P6NCS: Port 6 Schmidt trigger control register
SFRX(P6NCS, 0x7EFE1E);

// SFR P7NCS: Port 7 Schmidt trigger control register
SFRX(P7NCS, 0x7EFE1F);

// SFR P0SR: Port 0 level transition rate register
SFRX(P0SR, 0x7EFE20);

// SFR P1SR: Port 1 level transition rate register
SFRX(P1SR, 0x7EFE21);

// SFR P2SR: Port 2 level transition rate register
SFRX(P2SR, 0x7EFE22);

// SFR P3SR: Port 3 level transition rate register
SFRX(P3SR, 0x7EFE23);

// SFR P4SR: Port 4 level transition rate register
SFRX(P4SR, 0x7EFE24);

// SFR P5SR: Port 5 level transition rate register
SFRX(P5SR, 0x7EFE25);

// SFR P6SR: Port 6 level transition rate register
SFRX(P6SR, 0x7EFE26);

// SFR P7SR: Port 7 level transition rate register
SFRX(P7SR, 0x7EFE27);

// SFR P0DR: Port 0 drive current control register
SFRX(P0DR, 0x7EFE28);

// SFR P1DR: Port 1 drive current control register
SFRX(P1DR, 0x7EFE29);

// SFR P2DR: Port 2 drive current control register
SFRX(P2DR, 0x7EFE2A);

// SFR P3DR: Port 3 drive current control register
SFRX(P3DR, 0x7EFE2B);

// SFR P4DR: Port 4 drive current control register
SFRX(P4DR, 0x7EFE2C);

// SFR P5DR: Port 5 drive current control register
SFRX(P5DR, 0x7EFE2D);

// SFR P6DR: Port 6 drive current control register
SFRX(P6DR, 0x7EFE2E);

// SFR P7DR: Port 7 drive current control register
SFRX(P7DR, 0x7EFE2F);

// SFR P0IE: Port 0 input enable control register
SFRX(P0IE, 0x7EFE30);

// SFR P1IE: Port 1 input enable control register
SFRX(P1IE, 0x7EFE31);

// SFR P3IE: Port 3 input enable control register
SFRX(P3IE, 0x7EFE33);

// SFR I2CCFG: I2C configuration register
SFRX(I2CCFG, 0x7EFE80);
#define MSSPEED0 0x1
#define MSSPEED1 0x2
#define MSSPEED2 0x4
#define MSSPEED3 0x8
#define MSSPEED4 0x10
#define MSSPEED5 0x20
#define MSSL 0x40
#define ENI2C 0x80

// SFR I2CMSCR: I2C host control register
SFRX(I2CMSCR, 0x7EFE81);
#define MSCMD0 0x1
#define MSCMD1 0x2
#define MSCMD2 0x4
#define MSCMD3 0x8
#define EMSI 0x80

// SFR I2CMSST: I2C host status register
SFRX(I2CMSST, 0x7EFE82);
#define MSACKO 0x1
#define MSACKI 0x2
#define MSIF 0x40
#define MSBUSY 0x80

// SFR I2CSLCR: I2C slave control register
SFRX(I2CSLCR, 0x7EFE83);
#define SLRST 0x1
#define ESTOI 0x8
#define ETXI 0x10
#define ERXI 0x20
#define ESTAI 0x40

// SFR I2CSLST: I2C slave status register
SFRX(I2CSLST, 0x7EFE84);
#define SLACKO 0x1
#define SLACKI 0x2
#define TXING 0x4
#define STOIF 0x8
#define TXIF 0x10
#define RXIF 0x20
#define STAIF 0x40
#define SLBUSY 0x80

// SFR I2CSLADR: I2C slave address register
SFRX(I2CSLADR, 0x7EFE85);
#define MA 0x1
#define SLADR0 0x2
#define SLADR1 0x4
#define SLADR2 0x8
#define SLADR3 0x10
#define SLADR4 0x20
#define SLADR5 0x40
#define SLADR6 0x80

