ghosoft/stc-mcu-open-source/header-generator/stc16.h
// SFR I2CTXD: I2C data transmission register
SFRX(I2CTXD, 0x7EFE86);

// SFR I2CRXD: I2C data receive register
SFRX(I2CRXD, 0x7EFE87);

// SFR I2CMSAUX: I2C host auxiliary control register
SFRX(I2CMSAUX, 0x7EFE88);
#define WDTA 0x1

// SFR TM2PS: Timer 2 clock prescaler register
SFRX(TM2PS, 0x7EFEA2);

// SFR TM3PS: Timer 3 clock prescaler register
SFRX(TM3PS, 0x7EFEA3);

// SFR TM4PS: Timer 4 clock prescaler register
SFRX(TM4PS, 0x7EFEA4);

// SFR ADCTIM: ADC timing control register
SFRX(ADCTIM, 0x7EFEAB);
#define SMPDUTY0 0x1
#define SMPDUTY1 0x2
#define SMPDUTY2 0x4
#define SMPDUTY3 0x8
#define SMPDUTY4 0x10
#define CSHOLD0 0x20
#define CSHOLD1 0x40
#define CSSETUP 0x80

// SFR T3T4PIN: T3/T4 selection register
SFRX(T3T4PIN, 0x7EFEAC);
#define T3T4SEL 0x1

// SFR PWMA_ETRPS: PWMA ETR select register
SFRX(PWMA_ETRPS, 0x7EFEB0);
#define ETRAPS0 0x1
#define ETRAPS1 0x2
#define BRKAPS 0x4

// SFR PWMA_ENO: PWMA output enable control
SFRX(PWMA_ENO, 0x7EFEB1);
#define ENO1P 0x1
#define ENO1N 0x2
#define ENO2P 0x4
#define ENO2N 0x8
#define ENO3P 0x10
#define ENO3N 0x20
#define ENO4P 0x40
#define ENO4N 0x80

// SFR PWMA_PS: PWMA output pin selection register
SFRX(PWMA_PS, 0x7EFEB2);
#define C1PS0 0x1
#define C1PS1 0x2
#define C2PS0 0x4
#define C2PS1 0x8
#define C3PS0 0x10
#define C3PS1 0x20
#define C4PS0 0x40
#define C4PS1 0x80

// SFR PWMA_IOAUX: PWMA auxiliary register
SFRX(PWMA_IOAUX, 0x7EFEB3);
#define AUX1P 0x1
#define AUX1N 0x2
#define AUX2P 0x4
#define AUX2N 0x8
#define AUX3P 0x10
#define AUX3N 0x20
#define AUX4P 0x40
#define AUX4N 0x80

// SFR PWMB_ETRPS: PWMB ETR select register
SFRX(PWMB_ETRPS, 0x7EFEB4);
#define ETRBPS0 0x1
#define ETRBPS1 0x2
#define BRKBPS 0x4

// SFR PWMB_ENO: PWMB output enable control
SFRX(PWMB_ENO, 0x7EFEB5);
#define ENO5P 0x1
#define ENO6P 0x4
#define ENO7P 0x10
#define ENO8P 0x40

// SFR PWMB_PS: PWMB output pin selection register
SFRX(PWMB_PS, 0x7EFEB6);
#define C5PS0 0x1
#define C5PS1 0x2
#define C6PS0 0x4
#define C6PS1 0x8
#define C7PS0 0x10
#define C7PS1 0x20
#define C8PS0 0x40
#define C8PS1 0x80

// SFR PWMB_IOAUX: PWMB auxiliary register
SFRX(PWMB_IOAUX, 0x7EFEB7);
#define AUX5P 0x1
#define AUX6P 0x4
#define AUX7P 0x10
#define AUX8P 0x40

// SFR PWMA_CR1: PWMA control register 1
SFRX(PWMA_CR1, 0x7EFEC0);
#define CEN 0x1
#define UDIS 0x2
#define URS 0x4
#define OPM 0x8
#define DIR 0x10
#define CMS0 0x20
#define CMS1 0x40
#define ARPE 0x80

// SFR PWMA_CR2: PWMA control register 2
SFRX(PWMA_CR2, 0x7EFEC1);
#define CCPC 0x1
#define COMS 0x4
#define MMS0 0x10
#define MMS1 0x20
#define MMS2 0x40

// SFR PWMA_SMCR: PWMA slave mode control register
SFRX(PWMA_SMCR, 0x7EFEC2);
#define SMS0 0x1
#define SMS1 0x2
#define SMS2 0x4
#define TS0 0x10
#define TS1 0x20
#define TS2 0x40
#define MSM 0x80

// SFR PWMA_ETR: PWMA external trigger register
SFRX(PWMA_ETR, 0x7EFEC3);
#define ETF0 0x1
#define ETF1 0x2
#define ETF2 0x4
#define ETF3 0x8
#define ETPS0 0x10
#define ETPS1 0x20
#define ECE 0x40
#define ETP 0x80

// SFR PWMA_IER: PWMA interrupt enable register
SFRX(PWMA_IER, 0x7EFEC4);
#define UIE 0x1
#define CC1IE 0x2
#define CC2IE 0x4
#define CC3IE 0x8
#define CC4IE 0x10
#define COMIE 0x20
#define TIE 0x40
#define BIE 0x80

// SFR PWMA_SR1: PWMA status register 1
SFRX(PWMA_SR1, 0x7EFEC5);
#define UIF 0x1
#define CC1IF 0x2
#define CC2IF 0x4
#define CC3IF 0x8
#define CC4IF 0x10
#define COMIF 0x20
#define TIF 0x40
#define BIF 0x80

// SFR PWMA_SR2: PWMA status register 2
SFRX(PWMA_SR2, 0x7EFEC6);
#define CC1OF 0x2
#define CC2OF 0x4
#define CC3OF 0x8
#define CC4OF 0x10

// SFR PWMA_EGR: PWMA event register
SFRX(PWMA_EGR, 0x7EFEC7);
#define UG 0x1
#define CC1G 0x2
#define CC2G 0x4
#define CC3G 0x8
#define CC4G 0x10
#define COMG 0x20
#define TG 0x40
#define BG 0x80

// SFR PWMA_CCMR1: PWMA capture mode register 1
SFRX(PWMA_CCMR1, 0x7EFEC8);
#define CC1S0 0x1
#define CC1S1 0x2
#define OC1FE 0x4
#define OC1PE 0x8
#define OC1M0 0x10
#define OC1M1 0x20
#define OC1M2 0x40
#define OC1CE 0x80

// SFR PWMA_CCMR1: PWMA compare mode register 1
#define IC1PSC0 0x4
#define IC1PSC1 0x8
#define IC1F0 0x10
#define IC1F1 0x20
#define IC1F2 0x40
#define IC1F3 0x80

// SFR PWMA_CCMR2: PWMA capture mode register 2
SFRX(PWMA_CCMR2, 0x7EFEC9);
#define CC2S0 0x1
#define CC2S1 0x2
#define OC2FE 0x4
#define OC2PE 0x8
#define OC2M0 0x10
#define OC2M1 0x20
#define OC2M2 0x40
#define OC2CE 0x80

// SFR PWMA_CCMR2: PWMA compare mode register 2
#define IC2PSC0 0x4
#define IC2PSC1 0x8
#define IC2F0 0x10
#define IC2F1 0x20
#define IC2F2 0x40
#define IC2F3 0x80

// SFR PWMA_CCMR3: PWMA capture mode register 3
SFRX(PWMA_CCMR3, 0x7EFECA);
#define CC3S0 0x1
#define CC3S1 0x2
#define OC3FE 0x4
#define OC3PE 0x8
#define OC3M0 0x10
#define OC3M1 0x20
#define OC3M2 0x40
#define OC3CE 0x80

// SFR PWMA_CCMR3: PWMA compare mode register 3
#define IC3PSC0 0x4
#define IC3PSC1 0x8
#define IC3F0 0x10
#define IC3F1 0x20
#define IC3F2 0x40
#define IC3F3 0x80

// SFR PWMA_CCMR4: PWMA capture mode register 4
SFRX(PWMA_CCMR4, 0x7EFECB);
#define CC4S0 0x1
#define CC4S1 0x2
#define OC4FE 0x4
#define OC4PE 0x8
#define OC4M0 0x10
#define OC4M1 0x20
#define OC4M2 0x40
#define OC4CE 0x80

// SFR PWMA_CCMR4: PWMA compare mode register 4
#define IC4PSC0 0x4
#define IC4PSC1 0x8
#define IC4F0 0x10
#define IC4F1 0x20
#define IC4F2 0x40
#define IC4F3 0x80

// SFR PWMA_CCER1: PWMA capture compare enable register 1
SFRX(PWMA_CCER1, 0x7EFECC);
#define CC1E 0x1
#define CC1P 0x2
#define CC1NE 0x4
#define CC1NP 0x8
#define CC2E 0x10
#define CC2P 0x20
#define CC2NE 0x40
#define CC2NP 0x80

// SFR PWMA_CCER2: PWMA capture compare enable register 2
SFRX(PWMA_CCER2, 0x7EFECD);
#define CC3E 0x1
#define CC3P 0x2
#define CC3NE 0x4
#define CC3NP 0x8
#define CC4E 0x10
#define CC4P 0x20
#define CC4NE 0x40
#define CC4NP 0x80

// SFR PWMA_CNTRH: PWMA counter high byte
SFRX(PWMA_CNTRH, 0x7EFECE);

// SFR PWMA_CNTRL: PWMA counter low byte
SFRX(PWMA_CNTRL, 0x7EFECF);

// SFR PWMA_PSCRH: PWMA prescale high byte
SFRX(PWMA_PSCRH, 0x7EFED0);

// SFR PWMA_PSCRL: PWMA prescale low byte
SFRX(PWMA_PSCRL, 0x7EFED1);

// SFR PWMA_ARRH: PWMA auto-reload register high byte
SFRX(PWMA_ARRH, 0x7EFED2);

// SFR PWMA_ARRL: PWMA auto-reload register low byte
SFRX(PWMA_ARRL, 0x7EFED3);

// SFR PWMA_RCR: PWMA repeat counter register
SFRX(PWMA_RCR, 0x7EFED4);

