ghosoft/stc-mcu-open-source/header-generator/stc16.h
// SFR PWMA_CCR1H: PWMA compare capture register 1 high byte
SFRX(PWMA_CCR1H, 0x7EFED5);

// SFR PWMA_CCR1L: PWMA compare capture register 1 low byte
SFRX(PWMA_CCR1L, 0x7EFED6);

// SFR PWMA_CCR2H: PWMA compare capture register 2 high byte
SFRX(PWMA_CCR2H, 0x7EFED7);

// SFR PWMA_CCR2L: PWMA compare capture register 2 low byte
SFRX(PWMA_CCR2L, 0x7EFED8);

// SFR PWMA_CCR3H: PWMA compare capture register 3 high byte
SFRX(PWMA_CCR3H, 0x7EFED9);

// SFR PWMA_CCR3L: PWMA compare capture register 3 low byte
SFRX(PWMA_CCR3L, 0x7EFEDA);

// SFR PWMA_CCR4H: PWMA compare capture register 4 high byte
SFRX(PWMA_CCR4H, 0x7EFEDB);

// SFR PWMA_CCR4L: PWMA compare capture register 4 low byte
SFRX(PWMA_CCR4L, 0x7EFEDC);

// SFR PWMA_BKR: PWMA brake register
SFRX(PWMA_BKR, 0x7EFEDD);
#define LOCK0 0x1
#define LOCK1 0x2
#define OSSI 0x4
#define OSSR 0x8
#define BKE 0x10
#define BKP 0x20
#define AOE 0x40
#define MOE 0x80

// SFR PWMA_DTR: PWMA dead time control register
SFRX(PWMA_DTR, 0x7EFEDE);

// SFR PWMA_OISR: PWMA output idle status register
SFRX(PWMA_OISR, 0x7EFEDF);
#define OIS1 0x1
#define OIS1N 0x2
#define OIS2 0x4
#define OIS2N 0x8
#define OIS3 0x10
#define OIS3N 0x20
#define OIS4 0x40
#define OIS4N 0x80

// SFR PWMB_CR1: PWMB control register 1
SFRX(PWMB_CR1, 0x7EFEE0);

// SFR PWMB_CR2: PWMB control register 2
SFRX(PWMB_CR2, 0x7EFEE1);

// SFR PWMB_SMCR: PWMB slave mode control register
SFRX(PWMB_SMCR, 0x7EFEE2);

// SFR PWMB_ETR: PWMB external trigger register
SFRX(PWMB_ETR, 0x7EFEE3);

// SFR PWMB_IER: PWMB interrupt enable register
SFRX(PWMB_IER, 0x7EFEE4);
#define CC5IE 0x2
#define CC6IE 0x4
#define CC7IE 0x8
#define CC8IE 0x10

// SFR PWMB_SR1: PWMB status register 1
SFRX(PWMB_SR1, 0x7EFEE5);
#define CC5IF 0x2
#define CC6IF 0x4
#define CC7IF 0x8
#define CC8IF 0x10

// SFR PWMB_SR2: PWMB status register 2
SFRX(PWMB_SR2, 0x7EFEE6);
#define CC5OF 0x2
#define CC6OF 0x4
#define CC7OF 0x8
#define CC8OF 0x10

// SFR PWMB_EGR: PWMB event register
SFRX(PWMB_EGR, 0x7EFEE7);
#define CC5G 0x2
#define CC6G 0x4
#define CC7G 0x8
#define CC8G 0x10

// SFR PWMB_CCMR1: PWMB capture mode register 1
SFRX(PWMB_CCMR1, 0x7EFEE8);
#define CC5S0 0x1
#define CC5S1 0x2
#define OC5FE 0x4
#define OC5PE 0x8
#define OC5M0 0x10
#define OC5M1 0x20
#define OC5M2 0x40
#define OC5CE 0x80

// SFR PWMB_CCMR1: PWMB compare mode register 1
#define IC5PSC0 0x4
#define IC5PSC1 0x8
#define IC5F0 0x10
#define IC5F1 0x20
#define IC5F2 0x40
#define IC5F3 0x80

// SFR PWMB_CCMR2: PWMB capture mode register 2
SFRX(PWMB_CCMR2, 0x7EFEE9);
#define CC6S0 0x1
#define CC6S1 0x2
#define OC6FE 0x4
#define OC6PE 0x8
#define OC6M0 0x10
#define OC6M1 0x20
#define OC6M2 0x40
#define OC6CE 0x80

// SFR PWMB_CCMR2: PWMB compare mode register 2
#define IC6PSC0 0x4
#define IC6PSC1 0x8
#define IC6F0 0x10
#define IC6F1 0x20
#define IC6F2 0x40
#define IC6F3 0x80

// SFR PWMB_CCMR3: PWMB capture mode register 3
SFRX(PWMB_CCMR3, 0x7EFEEA);
#define CC7S0 0x1
#define CC7S1 0x2
#define OC7FE 0x4
#define OC7PE 0x8
#define OC7M0 0x10
#define OC7M1 0x20
#define OC7M2 0x40
#define OC7CE 0x80

// SFR PWMB_CCMR3: PWMB compare mode register 3
#define IC7PSC0 0x4
#define IC7PSC1 0x8
#define IC7F0 0x10
#define IC7F1 0x20
#define IC7F2 0x40
#define IC7F3 0x80

// SFR PWMB_CCMR4: PWMB capture mode register 4
SFRX(PWMB_CCMR4, 0x7EFEEB);
#define CC8S0 0x1
#define CC8S1 0x2
#define OC8FE 0x4
#define OC8PE 0x8
#define OC8M0 0x10
#define OC8M1 0x20
#define OC8M2 0x40
#define OC8CE 0x80

// SFR PWMB_CCMR4: PWMB compare mode register 4
#define IC8PSC0 0x4
#define IC8PSC1 0x8
#define IC8F0 0x10
#define IC8F1 0x20
#define IC8F2 0x40
#define IC8F3 0x80

// SFR PWMB_CCER1: PWMB capture compare enable register 1
SFRX(PWMB_CCER1, 0x7EFEEC);
#define CC5E 0x1
#define CC5P 0x2
#define CC5NE 0x4
#define CC5NP 0x8
#define CC6E 0x10
#define CC6P 0x20
#define CC6NE 0x40
#define CC6NP 0x80

// SFR PWMB_CCER2: PWMB capture compare enable register 2
SFRX(PWMB_CCER2, 0x7EFEED);
#define CC7E 0x1
#define CC7P 0x2
#define CC7NE 0x4
#define CC7NP 0x8
#define CC8E 0x10
#define CC8P 0x20
#define CC8NE 0x40
#define CC8NP 0x80

// SFR PWMB_CNTRH: PWMB counter high byte
SFRX(PWMB_CNTRH, 0x7EFEEE);

// SFR PWMB_CNTRL: PWMB counter low byte
SFRX(PWMB_CNTRL, 0x7EFEEF);

// SFR PWMB_PSCRH: PWMB prescale high byte
SFRX(PWMB_PSCRH, 0x7EFEF0);

// SFR PWMB_PSCRL: PWMB prescale low byte
SFRX(PWMB_PSCRL, 0x7EFEF1);

// SFR PWMB_ARRH: PWMB auto-reload register high byte
SFRX(PWMB_ARRH, 0x7EFEF2);

// SFR PWMB_ARRL: PWMB auto-reload register low byte
SFRX(PWMB_ARRL, 0x7EFEF3);

// SFR PWMB_RCR: PWMB repeat counter register
SFRX(PWMB_RCR, 0x7EFEF4);

// SFR PWMB_CCR1H: PWMB compare capture register 1 high byte
SFRX(PWMB_CCR1H, 0x7EFEF5);

// SFR PWMB_CCR1L: PWMB compare capture register 1 low byte
SFRX(PWMB_CCR1L, 0x7EFEF6);

// SFR PWMB_CCR2H: PWMB compare capture register 2 high byte
SFRX(PWMB_CCR2H, 0x7EFEF7);

// SFR PWMB_CCR2L: PWMB compare capture register 2 low byte
SFRX(PWMB_CCR2L, 0x7EFEF8);

// SFR PWMB_CCR3H: PWMB compare capture register 3 high byte
SFRX(PWMB_CCR3H, 0x7EFEF9);

// SFR PWMB_CCR3L: PWMB compare capture register 3 low byte
SFRX(PWMB_CCR3L, 0x7EFEFA);

// SFR PWMB_CCR4H: PWMB compare capture register 4 high byte
SFRX(PWMB_CCR4H, 0x7EFEFB);

// SFR PWMB_CCR4L: PWMB compare capture register 4 low byte
SFRX(PWMB_CCR4L, 0x7EFEFC);

// SFR PWMB_BKR: PWMB brake register
SFRX(PWMB_BKR, 0x7EFEFD);

// SFR PWMB_DTR: PWMB dead time control register
SFRX(PWMB_DTR, 0x7EFEFE);

// SFR PWMB_OISR: PWMB output idle status register
SFRX(PWMB_OISR, 0x7EFEFF);
#define OIS5 0x1
#define OIS6 0x4
#define OIS7 0x10
#define OIS8 0x40
// External interrupt 0
#define EXTINT0_INTERRUPT 0
#define EXTINT0_VECTOR_ADDR 0xFF0003
// Timer 0 interrupt
#define TIMER0_INTERRUPT 1
#define TIMER0_VECTOR_ADDR 0xFF000B
// External interrupt 1
#define EXTINT1_INTERRUPT 2
#define EXTINT1_VECTOR_ADDR 0xFF0013
// Timer 1 interrupt
#define TIMER1_INTERRUPT 3
#define TIMER1_VECTOR_ADDR 0xFF001B
// UART 1 interrupt
#define UART1_INTERRUPT 4
#define UART1_VECTOR_ADDR 0xFF0023
// ADC interrupt
#define ADC_INTERRUPT 5
#define ADC_VECTOR_ADDR 0xFF002B
// Low-voltage detector interrupt
#define LVD_INTERRUPT 6
#define LVD_VECTOR_ADDR 0xFF0033
// PWM A interrupt
#define PWMA_INTERRUPT 7
#define PWMA_VECTOR_ADDR 0x3B
// UART 2 interrupt
#define UART2_INTERRUPT 8
#define UART2_VECTOR_ADDR 0xFF0043
// SPI interrupt
#define SPI_INTERRUPT 9
#define SPI_VECTOR_ADDR 0xFF004B
// External interrupt 2 (falling edge only)
#define EXTINT2_INTERRUPT 10
#define EXTINT2_VECTOR_ADDR 0xFF0053
// External interrupt 3 (falling edge only)
#define EXTINT3_INTERRUPT 11
#define EXTINT3_VECTOR_ADDR 0xFF005B
// Timer 2 interrupt
#define TIMER2_INTERRUPT 12
#define TIMER2_VECTOR_ADDR 0xFF0063
// External interrupt 4 (falling edge only)
#define EXTINT4_INTERRUPT 16
#define EXTINT4_VECTOR_ADDR 0xFF0083
// UART 3 interrupt
#define UART3_INTERRUPT 17
#define UART3_VECTOR_ADDR 0xFF008B
// UART 4 interrupt
#define UART4_INTERRUPT 18
#define UART4_VECTOR_ADDR 0xFF0093
// Timer 3 interrupt
#define TIMER3_INTERRUPT 19
#define TIMER3_VECTOR_ADDR 0xFF009B
// Timer 4 interrupt
#define TIMER4_INTERRUPT 20
#define TIMER4_VECTOR_ADDR 0xFF00A3
// Comparator interrupt
#define CMP_INTERRUPT 21
#define CMP_VECTOR_ADDR 0xFF00AB
// USB interrupt
#define USB_INTERRUPT 22
#define USB_VECTOR_ADDR 0xFF00B3
// PWM B interrupt
#define PWMB_INTERRUPT 23
#define PWMB_VECTOR_ADDR 0xFF00BB
// I2C interrupt
#define I2C_INTERRUPT 24
#define I2C_VECTOR_ADDR 0xFF00C3
// CAN interrupt
#define CANBUS_INTERRUPT 28
#define CANBUS_VECTOR_ADDR 0xFF00E3
// LIN interrupt
#define LINBUS_INTERRUPT 29
#define LINBUS_VECTOR_ADDR 0xFF00EB

// Default value for macro F_CPU
#ifndef F_CPU
#define F_CPU 24000000UL
#endif

// Default value for macro T_CPU
#ifndef T_CPU
#define T_CPU 1
#endif

#endif // _STC16_H
